results/2/server1/apiary-1.0.0/PARAM.log
Benchmarking PARAM
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.73ms   20.50ms   1.72s    96.37%
    Req/Sec    22.14k     2.97k   29.89k    68.67%
  1286888 requests in 30.00s, 218.45MB read
  Socket errors: connect 0, read 0, write 0, timeout 413
Requests/sec:  42896.45
Transfer/sec:      7.28MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.84ms   25.41ms   2.30s    99.52%
    Req/Sec    22.13k     6.54k   39.06k    68.30%
  1295490 requests in 30.00s, 219.91MB read
Requests/sec:  43182.56
Transfer/sec:      7.33MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.21ms    8.71ms 805.82ms   98.43%
    Req/Sec    22.14k     1.67k   29.85k    74.71%
  1299092 requests in 30.00s, 220.53MB read
  Socket errors: connect 0, read 0, write 0, timeout 134
Requests/sec:  43302.71
Transfer/sec:      7.35MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.15ms   11.64ms   1.41s    98.65%
    Req/Sec    22.28k     2.25k   31.22k    73.37%
  1306212 requests in 30.00s, 221.73MB read
  Socket errors: connect 0, read 0, write 0, timeout 60
Requests/sec:  43540.15
Transfer/sec:      7.39MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.30ms   10.03ms   1.21s    98.25%
    Req/Sec    22.09k     2.06k   31.11k    71.72%
  1294752 requests in 30.00s, 219.79MB read
  Socket errors: connect 0, read 0, write 0, timeout 74
Requests/sec:  43158.48
Transfer/sec:      7.33MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.28ms   13.15ms   1.30s    98.87%
    Req/Sec    22.31k     2.07k   30.87k    77.65%
  1303923 requests in 30.00s, 221.35MB read
  Socket errors: connect 0, read 0, write 0, timeout 65
Requests/sec:  43464.00
Transfer/sec:      7.38MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.93ms   14.45ms   1.29s    91.55%
    Req/Sec    22.16k     2.12k   27.85k    72.09%
  1299424 requests in 30.00s, 220.58MB read
  Socket errors: connect 0, read 0, write 0, timeout 258
Requests/sec:  43313.45
Transfer/sec:      7.35MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.11ms   32.38ms   2.61s    99.73%
    Req/Sec    22.47k     5.88k   38.40k    62.77%
  1297070 requests in 30.00s, 220.18MB read
  Socket errors: connect 0, read 0, write 0, timeout 76
Requests/sec:  43235.23
Transfer/sec:      7.34MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.55ms   11.22ms   1.19s    94.93%
    Req/Sec    22.04k     2.27k   28.69k    69.26%
  1295450 requests in 30.00s, 219.91MB read
Requests/sec:  43181.22
Transfer/sec:      7.33MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.49ms   20.80ms   2.05s    98.76%
    Req/Sec    22.23k     4.92k   32.78k    58.92%
  1298836 requests in 30.00s, 220.48MB read
  Socket errors: connect 0, read 0, write 0, timeout 341
Requests/sec:  43294.14
Transfer/sec:      7.35MB
=================== summary ===================
machine:      server1
ghc version:  7.8.3
bench target: apiary-1.0.0
bench:        PARAM
bench mode:   30s * 10
average:      43256.84
stdev:        176.74
=================== oneline ===================
server1,7.8.3,apiary-1.0.0,PARAM,30s,10,43256.84,176.74